# -*- coding: utf-8 -*-
##############################################################################
# Author：QQ173782910
##############################################################################

# 注意：
#    持仓方向为单向,不会设置杠杆
#    下边的dingding_token,wx_openid为空的话是不会发送钉钉消息和公众号消息

version_flag = '20210923'

key = ""  # 币安API的key
secret = ""  # 币安API的secret

dingding_token = ""  # 钉钉webhook的access_token
wx_openid = ""  # 关注简道斋后发送openid得到的那一串字符就是这个

tactics_flag = 0  # 此为机器人执行策略计算无信号是否发送钉钉消息，约5分钟发送一次，1为发送，不发送请留空或其他值

symbols_conf = [["AAVEUSDT", 0.1, 28, 72.5, 10, 10],  # ok
                ["KSMUSDT", 0.3, 28, 72.5, 10, 10],  # ok
                ["UNIUSDT", 1.0, 28, 72.5, 10, 10],  # ok
                ["EGLDUSDT", 0.6, 27, 72.5, 10, 10],  # ok
                ["BNBUSDT", 0.03, 28, 72.5, 10, 10],  # ok
                ["SOLUSDT", 1, 28, 72.5, 10, 10],  # ok
                ["DOTUSDT", 0.3, 28, 72.5, 10, 10],  # ok
                ["BTCUSDT", 0.002, 28, 72.5, 10, 10],  # ok
                ["YFIUSDT", 0.002, 28, 72.5, 10, 10],  # ok
                ["ETHUSDT", 0.002, 28, 72.5, 5, 10],  # ok
                ["LTCUSDT", 0.03, 28, 72.5, 10, 10],  # ok
                ["BCHUSDT", 0.08, 28, 72.5, 10, 10],  # ok
                ["MKRUSDT", 0.013, 28, 72.5, 10, 10],  # ok
                ["DASHUSDT", 0.03, 28, 72.5, 10, 10],  # ok
                ["ZECUSDT", 0.5, 28, 72.5, 10, 10],  # ok
                ["ZENUSDT", 0.3, 28, 72.5, 10, 10],  # ok
                ["FILUSDT", 0.4, 28, 72.5, 10, 10],  # ok
                ["AVAXUSDT", 1, 28, 72.5, 10, 10],  # ok
                ["LUNAUSDT", 2, 28, 72.5, 5, 10],  # ok
                ["YFIIUSDT", 0.003, 28, 72.5, 10, 10],  # ok
                ["COMPUSDT", 0.03, 28, 72.5, 10, 10],  # ok
                ["XMRUSDT", 0.05, 28, 72.5, 5, 10],  # ok
                ["TRBUSDT", 0.5, 28, 72.5, 10, 10],  # ok
                ["NEOUSDT", 0.5, 28, 72.5, 10, 10],  # ok
                ["NEARUSDT", 4.0, 28, 72.5, 10, 10],  # ok
                ["ATOMUSDT", 0.5, 28, 72.5, 10, 10],  # ok
                ]
