# -*- coding: utf-8 -*-
##############################################################################
# Author：QQ173782910
##############################################################################
import redis
# 注意：
#    持仓方向为单向,不会设置杠杆
#    下边的dingding_token,wx_openid为空的话是不会发送钉钉消息和公众号消息

version_flag = '20211010'

key = ""  # 币安API的key
secret = ""  # 币安API的secret

dingding_token = ""  # 钉钉webhook的access_token
wx_openid = ""  # 关注简道斋后发送openid得到的那一串字符就是这个

tactics_flag = 0  # 此为机器人消息，1为策略计算没有买卖信号时发送，2为每次发钉钉消息都打印，3为打印ws消息
add_pos_flag = 0  # 加仓标识，为1开启，0关闭,加仓是当币在扛单中，再次遇到开仓信号就又开一次仓，这样会降低持仓均价，但爆仓风险更大
add_pos_amount = 0  # 加仓次数，0不限次数，其他的整数值为最大加仓次数，每个币的次数一样，不单独设置

# [币对,下单量,止盈参数,补仓参数]  补仓:是币已经止盈，当前无持仓，当币价回调到一定价格就再次开仓
symbols_conf = [["AAVEUSDT", 0.1, 1.006, 0.985],  # ok
                ["KSMUSDT", 0.3, 1.006, 0.985],  # ok
                ["UNIUSDT", 1.0, 1.006, 0.985],  # ok
                ["EGLDUSDT", 0.6, 1.01, 0.98],  # ok
                ["BNBUSDT", 0.03, 1.006, 0.985],  # ok
                ["SOLUSDT", 1, 1.01, 0.98],  # ok
                ["DOTUSDT", 0.4, 1.006, 0.985],  # ok
                ["YFIUSDT", 0.002, 1.006, 0.985],  # ok
                ["ETHUSDT", 0.002, 1.006, 0.985],  # ok
                ["LTCUSDT", 0.03, 1.006, 0.985],  # ok
                ["BCHUSDT", 0.08, 1.006, 0.985],  # ok
                ["MKRUSDT", 0.005, 1.006, 0.985],  # ok
                ["DASHUSDT", 0.05, 1.006, 0.985],  # ok
                ["ZECUSDT", 0.5, 1.008, 0.985],  # ok
                ["ZENUSDT", 0.3, 1.006, 0.985],  # ok
                ["FILUSDT", 0.4, 1.006, 0.985],  # ok
                ["AVAXUSDT", 1, 1.006, 0.985],  # ok
                ["LUNAUSDT", 2, 1.006, 0.985],  # ok
                ["YFIIUSDT", 0.003, 1.006, 0.985],  # ok
                ["COMPUSDT", 0.03, 1.006, 0.985],  # ok
                ["XMRUSDT", 0.05, 1.006, 0.985],  # ok
                ["TRBUSDT", 0.5, 1.008, 0.985],  # ok
                ["NEOUSDT", 0.5, 1.008, 0.985],  # ok
                ["NEARUSDT", 4.0, 1.008, 0.985],  # ok
                ["ATOMUSDT", 0.5, 1.008, 0.985],  # ok
                ["AXSUSDT", 1, 1.006, 0.985],
                ["ICPUSDT", 0.4, 1.006, 0.985],
                ["WAVESUSDT", 0.4, 1.006, 0.985],
                ["LINKUSDT", 0.4, 1.006, 0.985],
                ["BALUSDT", 0.4, 1.006, 0.985],
                ["HNTUSDT", 1, 1.006, 0.985],
                ["DYDXUSDT", 0.5, 1.006, 0.985],
                ["ALICEUSDT", 0.7, 1.006, 0.985],
                ["SNXUSDT", 0.8, 1.006, 0.985],
                ["QTUMUSDT", 0.7, 1.006, 0.985],
                ["RAYUSDT", 0.6, 1.006, 0.985],
                ["SUSHIUSDT", 2, 1.008, 0.985],
                ["OMGUSDT", 0.7, 1.006, 0.985],
                ["MASKUSDT", 1, 1.006, 0.985],
                ["UNFIUSDT", 0.8, 1.006, 0.985],
                ["SRMUSDT", 2, 1.006, 0.985],
                ["GTCUSDT", 0.9, 1.006, 0.985],
                ["RUNEUSDT", 2, 1.006, 0.985],
                ["BANDUSDT", 1, 1.006, 0.985],
                ["XTZUSDT", 2, 1.006, 0.985],
                ["THETAUSDT", 2, 1.006, 0.985],
                ["KAVAUSDT", 2, 1.006, 0.985],
                ]

symbols_conf2 = [["ARUSDT", 0.2, 1.006, 0.985],  # ok
                 ["CELOUSDT", 1, 1.006, 0.985],  # ok
                 ["RLCUSDT", 1.5, 1.006, 0.985],  # ok
                 ["LITUSDT", 1.5, 1.006, 0.985],  # ok
                 ["C98USDT", 2, 1.006, 0.985],  # ok
                 ["MTLUSDT", 2, 1.006, 0.985],
                 ["1INCHUSDT", 2, 1.006, 0.985],
                 ["CRVUSDT", 2.5, 1.006, 0.985],
                 ["SXPUSDT", 2.6, 1.006, 0.985],
                 ["AUDIOUSDT", 3, 1.006, 0.985],  # ok

                 ["TOMOUSDT", 3, 1.006, 0.985],  # ok
                 ["ADAUSDT", 3, 1.008, 0.985],
                 ["ICXUSDT", 3, 1.006, 0.985],
                 ["BAKEUSDT", 3, 1.006, 0.985],
                 ["BELUSDT", 3, 1.006, 0.985],
                 ["ALGOUSDT", 3.5, 1.006, 0.985],
                 ["CTKUSDT", 3, 1.006, 0.985],  # ok
                 ["KNCUSDT", 4, 1.006, 0.985],
                 ["ENJUSDT", 4, 1.006, 0.985],
                 ["FTMUSDT", 4, 1.006, 0.985],

                 ["DODOUSDT", 4.4, 1.006, 0.985],  # ok
                 ["MATICUSDT", 5, 1.006, 0.985],
                 ["IOTAUSDT", 4.7, 1.006, 0.985],
                 ["STORJUSDT", 5, 1.006, 0.985],
                 ["XRPUSDT", 6, 1.006, 0.985],  # ok
                 ["RENUSDT", 6, 1.006, 0.985],  # ok
                 ["SFPUSDT", 6, 1.006, 0.985],
                 ["ZRXUSDT", 7.3, 1.006, 0.985],
                 ["ALPHAUSDT", 7, 1.006, 0.985],
                 ["ATAUSDT", 7, 1.006, 0.985],  # ok

                 ["ONTUSDT", 6.5, 1.006, 0.985],
                 ["OGNUSDT", 7, 1.006, 0.985],
                 ["SANDUSDT", 7, 1.006, 0.985],
                 ["MANAUSDT", 8, 1.006, 0.985],
                 ["GRTUSDT", 8, 1.006, 0.985],
                 ["OCEANUSDT", 7, 1.006, 0.985],
                 ["BATUSDT", 8.4, 1.006, 0.985],
                 ["CVCUSDT", 11, 1.006, 0.985],
                 ["FLMUSDT", 11, 1.006, 0.985],
                 ["KEEPUSDT", 15, 1.006, 0.985],

                 ]

symbols_conf3 = [
                 ["LRCUSDT", 16, 1.006, 0.985],
                 ["HBARUSDT", 16, 1.006, 0.985],
                 ["CHRUSDT", 18, 1.006, 0.985],
                 ["SKLUSDT", 19, 1.006, 0.985],
                 ["NKNUSDT", 16, 1.006, 0.985],
                 ["XLMUSDT", 17, 1.006, 0.985],
                 ["BZRXUSDT", 20, 1.006, 0.985],
                 ["CHZUSDT", 20, 1.006, 0.985],
                 ["1000XECUSDT", 27, 1.006, 0.985],
                 ["BLZUSDT", 24, 1.006, 0.985],

                 ["DOGEUSDT", 24, 1.006, 0.985],
                 ["TLMUSDT", 30, 1.006, 0.985],
                 ["ONEUSDT", 35, 1.006, 0.985],
                 ["XEMUSDT", 36, 1.006, 0.985],
                 ["CELRUSDT", 44, 1.006, 0.985],
                 ["VETUSDT", 53, 1.006, 0.985],
                 ["RVNUSDT", 54, 1.006, 0.985],
                 ["GALAUSDT", 61, 1.006, 0.985],
                 ["ZILUSDT", 62, 1.006, 0.985],
                 ["TRXUSDT", 63, 1.006, 0.985],

                 ["ANKRUSDT", 69, 1.006, 0.985],
                 ["IOSTUSDT", 111, 1.006, 0.985],
                 ["DGBUSDT", 116, 1.006, 0.985],
                 ["RSRUSDT", 158, 1.006, 0.985],
                 ["LINAUSDT", 127, 1.006, 0.985],
                 ["BTSUSDT", 128, 1.006, 0.985],
                 ["STMXUSDT", 183, 1.006, 0.985],
                 ["AKROUSDT", 209, 1.006, 0.985],
                 ["SCUSDT", 325, 1.006, 0.985],
                 ["1000SHIBUSDT", 205, 1.006, 0.985],
                 ["DENTUSDT", 1000, 1.006, 0.985],
                 ]

redis_pool = redis.ConnectionPool(host='127.0.0.1', port='6379', db='0', password='')
redisc = redis.StrictRedis(connection_pool=redis_pool)
